[
    [
        2.06, "2023/01/01",
        [
            ["new", "Added Nightmare raid map made by reddit user SJack2."]
        ]
    ],
    [
        2.05, "2022/12/29",
        [
            ["fix", "SC Heroes and their normal version in the same team."],
            ["fix", "Setting role/attribute to a negative value will no longer trigger advanced settings calculation."]
        ]
    ],
    [
        2.01, "2022/12/22",
        [
            ["fix", "Fixed old roster URLs not being parsed correctly."]
        ]
    ],
    [
        2.00, "2022/12/22",
        [
            ["new", "New code, easier to edit and add new features. Also now it's easier to translate, contact me if you are interested in helping translate."],
            ["new", "Better image viewer for maps."],
            ["new", "Better changelog."],
            ["new", "Shorter Export URLs. When generating URLs to transfer/share your roster the length of the URL has been reduced, URLs generated with the old Camp Simulator are still compatible."],
            ["new", "When saving a team you can change the team formation by clicking the characters and moving them in the 4 slots.<br>Now you can also provide a description to help future you."],
            ["new", "Popular teams and characters page has been updated.<br>Now you can sort the results and filter by a specific unit.<br>If you see a team you like you can click it and you can save it in your teams.<br>unfortunately I had to reset the old stats because the data was unreliable and too hard to work with.<br>The old data can be viewed at the bottom of the stats page."],
            ["new", "Overall UI improvments for better mobile support."],
            ["fix", "Fixed an issue that in the old camping simulator caused the \"Team size exceeded\" error while \"Locked heroes count towards the fulfillment of the selected advanced settings\" and 4 heroes where locked."],
            ["removed", "Help messages. Help windows will be back sometime in the future."]
        ]
    ]
]