[
    [
        1.60, "04/12/2022",
        [
            ["new", "New clone/duplicate feature.\nDo you ever feel like you need to rank the same character/artifact in 2 different tiers? Now you can!\nRight click a character or artifact and select \"Clone element\" from the contextual menu.\n<img src=\"https://i.imgur.com/tJvGiZC.png\" height=\"150px\" /><img src=\"https://i.imgur.com/uq2xIdL.png\" />\nNow you can move the new element anywhere you wish. Clones can have different skins equiped and different comments.\nTo delete a duplicated element right click the clone and select \"Delete clone\", this option won't appear on the original element."]
        ]
    ],
    [
        1.52, "25/11/2022",
        [
            ["new", "Added new emotes: RasOk, RasWave, RasLaugh, VildredThink, VildredAngry, MercedesShocked, MercedesCry, AitherFlex, AitherTongue and some Guild Wars icons"],
            ["new", "Now you can resize the label's width to better fit your text!\nMove the cursor to the right border of the label then click and hold the left button to start resizing:\n<img src=\"https://i.imgur.com/1W10y6N.png\" style=\"height: 5em\" />"],
            ["fix", "Better support for emotes inside the labels.\nFixed an issue that caused emotes in the label to automatically line break"]
        ]
    ],
    [
        1.5, "01/09/2022",
        [
            ["new", "Now you can see this changelog!"],
            ["new", "Everything has been written from scratch with Vue 3 (from Vue 2 to Vue 3)"],
            ["new", "Emote support! Type <b>\":\"</b> + the name of a emote.\nExample:\n:DieneL: will be converted to <img src=\"https://res.cloudinary.com/ceciliabot/image/upload/epic-seven/ui/emote/c1076_heart_001.webp\" style=\"height: 1.5em; vertical-align: middle;\" />\n:BOOBA: will be converted to <img src=\"https://res.cloudinary.com/ceciliabot/image/upload/epic-seven/ui/emote/BOOBA.webp\" style=\"height: 1.5em; vertical-align: middle;\" />"],
            ["fix", "Improvments to the 'Apply filter to ranked elements': Now the items that don't match the filter or search query will not disappear but decrease their opacity so you can move items around without disabling the filter"],
            ["new", "Add support for full size hero images (_su.png). Patched html2canvas.js to correctly export this type of icons."],
            ["fix", "Fixed artifact icons not dispaying Role and Rarity icons."],
            ["fix", "Fix ugly flicker on Firefox."],
            ["new", "Added \"Add above\" and \"Add below\" otions for quicker tier row creation in the \"Tier Row Settings\" modal."],
            ["new", "You can now Save as PNG without including the title in the image. (You can enable this option in the settings menu) "],
            ["new", "When exporting as PNG you can now view a preview of the image (Zoom and move around). You can right click or click the download icon to the save the image!"],
            ["bug", "Vertical tier list maker layout with Alignment Chart will display incorrectly"]
        ]
    ],
    [
        1.4, "13/05/2022",
        [
            ["new", "Alignment tier list now available."],
            ["new", "Character skins now are available. You can select a skin by pressing right click on a character with ingame skins."],
            ["new", "Added a shortcut to the E7Vault model viewer"]
        ]
    ],
    [
        1.2, "15/04/2022",
        [
            ["new", "Comments for tier elements are now available on mobile. Tap a character to view and edit comments."]
        ]
    ],
    [
        1.11, "27/03/2022",
        [
            ["new", "Added <code>CTRL+F</code> shortcut for PC users. It will focus and select all of the text inside the search bar."]
        ]
    ],
    [
        1.1, "18/03/2022",
        [
            ["new", "Added Search bar"],
            ["new", "Added new filter: Gender."]
        ]
    ]
]