[
    [
        1.5, "11/08/2022",
        [
            ["new", "Now you can see this changelog!"],
            ["new", "Everything has been written from scratch with Vue 3 (from Vue 2 to Vue 3)"],
            ["new", "Now you can use some emotes like :speedset: (or some emotes like :BOOBA:). Emotes can be used for: Tier List Name, Tier Row Name, Character comments and XY Graph axes!. A suggestion box will appear after you type \":\" showing some of the matching emotes, press enter to input that emote."],
            ["fix", "Improvments to ther 'Apply filter to ranked elements': Now the items that don't match the filter or search query will not disappear but decrease their opacity so you can move items around without disabling the filter"],
            ["new", "Add support for full size hero images (_su.png). Patched html2canvas.js to correctly export this type of icons."],
            ["fix", "Fixed artifact icons not dispaying Role and Rarity icons."],
            ["fix", "Fix ugly flicker on Firefox."],
            ["new", "Added \"Add above\" and \"Add below\" otions for quicker tier row creation in the \"Tier Row Settings\" modal."],
            ["new", "You can now Save as PNG without including the title in the image. (You can enable this option in the settings menu) "],
            ["new", "When exporting as PNG you can now view a preview of the image (Zoom and move around). You can right click or click the download icon to the save the image!"]
        ]
    ],
    [
        1.4, "13/05/2022",
        [
            ["new", "Alignment tier list now available."],
            ["new", "Character skins now are available. You can select a skin by pressing right click on a character with ingame skins."],
            ["new", "Added a shortcut to the E7Vault model viewer"]
        ]
    ],
    [
        1.2, "15/04/2022",
        [
            ["new", "Comments for tier elements are now available on mobile. Tap a character to view and edit comments."]
        ]
    ],
    [
        1.11, "27/03/2022",
        [
            ["new", "Added <code>CTRL+F</code> shortcut for PC users. It will focus and select all of the text inside the search bar."]
        ]
    ],
    [
        1.1, "18/03/2022",
        [
            ["new", "Added Search bar"],
            ["new", "Added new filter: Gender."]
        ]
    ]
]